# ItemFactoryBase Methods (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
ItemFactoryBase Methods
ItemFactoryBase Class See Also
---
The ItemFactoryBase type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose | Causes the object to release immediately any resources it may be utilizing. (Inherited from APIObject.) |
| Equals | Determines whether the specified Object is equal to the current Object. (Inherited from Object.) |
| GetHashCode | Serves as a hash function for a particular type.  (Inherited from Object.) |
| GetType | Gets the Type of the current instance. (Inherited from Object.) |
| NewAlignment | Add a new locked alignment into the Autodesk Revit document. |
| NewDetailCurve | Creates a new detail curve element. |
| NewDetailCurveArray | Creates an array of new detail curve elements. |
| NewDimension(View, Line, ReferenceArray) | Creates a new linear dimension object using the default dimension style. |
| NewDimension(View, Line, ReferenceArray, DimensionType) | Creates a new linear dimension object using the specified dimension style. |
| NewFamilyInstance(Face, Line, FamilySymbol) | Inserts a new instance of a family onto a face of an existing element, using a line on that face for its position, and a type/symbol. |
| NewFamilyInstance(Line, FamilySymbol, View) | Add a line based detail family instance into the Autodesk Revit document, using an line and a view where the instance should be placed. |
| NewFamilyInstance(Reference, Line, FamilySymbol) | Inserts a new instance of a family onto a face referenced by the input Reference instance, using a line on that face for its position, and a type/symbol. |
| NewFamilyInstance(XYZ, FamilySymbol, StructuralType) | Inserts a new instance of a family into the document, using a location and a type/symbol. |
| NewFamilyInstance(XYZ, FamilySymbol, View) | Add a new family instance into the Autodesk Revit document, using an origin and a view where the instance should be placed. |
| NewFamilyInstance(Face, XYZ, XYZ, FamilySymbol) | Inserts a new instance of a family onto a face of an existing element, using a location, reference direction, and a type/symbol. |
| NewFamilyInstance(Reference, XYZ, XYZ, FamilySymbol) | Inserts a new instance of a family onto a face referenced by the input Reference instance, using a location, reference direction, and a type/symbol. |
| NewFamilyInstance(XYZ, FamilySymbol, Element, StructuralType) | Inserts a new instance of a family into the document, using a location, type/symbol, and the host element. |
| NewFamilyInstance(XYZ, FamilySymbol, Level, StructuralType) | Inserts a new instance of a family into the document, using a location, type/symbol, and the level. |
| NewFamilyInstance(XYZ, FamilySymbol, XYZ, Element, StructuralType) | Inserts a new instance of a family into the document, using a location, type/symbol, the host element and a reference direction. |
| NewFamilyInstances2 | Creates Family instances within the document. |
| NewGroup | Creates a new type of group. |
| NewModelCurve | Creates a new model line element. |
| NewModelCurveArray | Creates an array of new model line elements. |
| NewReferencePlane | Creates a new instance of ReferencePlane. |
| NewReferencePlane2 | Creates a new instance of ReferencePlane. |
| PlaceGroup | Place an instance of a Model Group into the Autodesk Revit document, using a location and a group type. |
| ToString | Returns a string that represents the current object. (Inherited from Object.) |

# See Also
ItemFactoryBase Class
Autodesk.Revit.Creation Namespace